<h1 id="ios---">iOS-&#x4E24;&#x79CD;&#x67B6;&#x6784;&#x6D45;&#x8C08; &#x548C; &#x86CB;&#x75BC;&#x7684;&#x4EE3;&#x7406;&#x56DE;&#x8C03;&#x4F20;&#x503C;</h1>
<hr>
<h1>&#x7B2C;&#x4E00;&#x79CD;&#x67B6;&#x6784;</h1>
<p><img src="http://ww1.sinaimg.cn/large/7305b707jw1f1qoznxmc2j20pu15wn2b.jpg" alt="1"></p>
<h3 id="mvccontrollercontrollercontrollerkvcmodelcontrollercontroller">&#x7528;&#x7684;&#x662F;MVC&#x6A21;&#x5F0F;&#xFF0C;&#x5982;&#x56FE;&#x4E0A;&#x6240;&#x793A;&#xFF0C;Controller&#x9700;&#x8981;&#x6570;&#x636E;&#xFF0C;&#x5411;&#x6570;&#x636E;&#x5C42;&#x8BF7;&#x6C42;&#xFF0C;&#x6570;&#x636E;&#x5C42;&#x5224;&#x65AD;&#x8981;&#x8BF7;&#x6C42;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x548C;&#x79CD;&#x7C7B;&#xFF0C;&#x5411;&#x7F51;&#x7EDC;&#x5C42;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#xFF0C;&#x7F51;&#x7EDC;&#x5C42;&#x8BF7;&#x6C42;&#x5230;&#x6570;&#x636E;&#x540E;&#x8FD4;&#x56DE;&#x7ED9;&#x6570;&#x636E;&#x5C42;&#xFF0C;&#x6570;&#x636E;&#x5C42;&#x62FF;&#x5230;&#x6570;&#x636E;&#x540E;&#x518D;&#x4F20;&#x7ED9;Controller&#xFF0C;&#x5728;Controller&#x4E2D;&#x901A;&#x8FC7;KVC&#x5B57;&#x5178;&#x8F6C;Model&#xFF0C;&#x5B58;&#x50A8;&#x5230;Controller&#x7684;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;Controller&#x76F4;&#x63A5;&#x62FF;&#x672C;&#x63A7;&#x5236;&#x5668;&#x4E2D;&#x7684;&#x6570;&#x7EC4;&#x3002;</h3>
<h4 id="controllercontroller">&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x53FB;&#xFF0C;Controller&#x91CC;&#x9762;&#x6709;&#x6570;&#x7EC4;&#xFF0C;&#x5BF9;Controller&#x7684;&#x538B;&#x529B;&#x6709;&#x70B9;&#x513F;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x6A21;&#x5F0F;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x201C;&#x53D6;&#x201D;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#x3002;&#x3002;&#x3002;</h4>
<hr>
<h1>&#x7B2C;&#x4E8C;&#x79CD;&#x67B6;&#x6784;</h1>
<p><img src="http://ww1.sinaimg.cn/large/7305b707jw1f1qpcruapwj20qc15sgqg.jpg" alt="2"></p>
<h3 id="mvccontrollerkvcmodelcontroller">&#x7528;&#x7684;&#x4E5F;&#x662F;MVC&#x6A21;&#x5F0F;&#xFF0C;&#x5982;&#x56FE;&#x4E0A;&#x6240;&#x793A;&#xFF0C;Controller&#x9700;&#x8981;&#x6570;&#x636E;&#xFF0C;&#x5411;&#x6570;&#x636E;&#x5C42;&#x8BF7;&#x6C42;&#xFF0C;&#x6570;&#x636E;&#x5C42;&#x5224;&#x65AD;&#x8981;&#x8BF7;&#x6C42;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x548C;&#x79CD;&#x7C7B;&#xFF0C;&#x5411;&#x7F51;&#x7EDC;&#x5C42;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#xFF0C;&#x7F51;&#x7EDC;&#x5C42;&#x8BF7;&#x6C42;&#x5230;&#x6570;&#x636E;&#x540E;&#x8FD4;&#x56DE;&#x7ED9;&#x6570;&#x636E;&#x5C42;&#xFF0C;&#x6570;&#x636E;&#x5C42;&#x4E2D;&#x901A;&#x8FC7;KVC&#x5B57;&#x5178;&#x8F6C;Model&#x5B58;&#x653E;&#x5728;&#x6570;&#x636E;&#x5C42;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;Controller&#x9700;&#x8981;&#x6570;&#x636E;&#x76F4;&#x63A5;&#x5411;&#x6570;&#x636E;&#x5C42;&#x62FF;&#x53D6;&#x6570;&#x636E;&#x3002;</h3>
<h4 id="controllercontrollercontroller">&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x53FB;&#xFF0C;Controller&#x91CC;&#x9762;&#x6CA1;&#x6709;&#x5B58;&#x653E;&#x6570;&#x636E;&#x6570;&#x7EC4;&#xFF0C;&#x6570;&#x636E;&#x6570;&#x7EC4;&#x5B58;&#x653E;&#x5728;&#x6570;&#x636E;&#x5C42;&#xFF0C;&#x8FD9;&#x6837;&#x53FB;&#xFF0C;&#x5BF9;&#x5E94;&#x4E86;&#x6570;&#x636E;&#x5C42;&#x5C31;&#x5E94;&#x8BE5;&#x5904;&#x7406;&#x6570;&#x636E;&#x7684;&#x4E8B;&#x513F;&#xFF0C;&#x5206;&#x5DE5;&#x660E;&#x786E;&#xFF0C;&#x800C;&#x4E14;Controller&#x63A7;&#x5236;&#x5668;&#x53D8;&#x5F97;&#x8F7B;&#x91CF;&#x7EA7;&#xFF0C;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x4E86;controller&#x7684;&#x538B;&#x529B;&#x3002;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x6709;&#x70B9;&#x4E0D;&#x597D;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x662F;&#x201C;&#x53D6;&#x201D;&#x6570;&#x636E;&#x4E0D;&#x65B9;&#x4FBF;&#x3002;&#x53D6;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#x63A7;&#x5236;&#x5668;&#x8FD8;&#x9700;&#x8981;&#x5411;&#x6570;&#x636E;&#x5C42;&#x62FF;&#x53D6;&#x3002;</h4>
<h1>&#x86CB;&#x75BC;&#x7684;&#x4EE3;&#x7406;&#x56DE;&#x8C03;&#x4F20;&#x503C;</h1>
<h4>&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x56DE;&#x8C03;&#x4F20;&#x503C;&#x771F;&#x7684;&#x5F88;&#x86CB;&#x75BC;&#x3002;</h4>
<p><strong>&#x63A7;&#x5236;&#x5668;&#x5411;&#x6570;&#x636E;&#x5C42;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#xFF0C;&#x6570;&#x636E;&#x5C42;&#x5411;&#x7F51;&#x7EDC;&#x5C42;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#xFF0C;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x4E0D;&#x4E00;&#x5B9A;&#x6709;&#x56DE;&#x8C03;&#xFF0C;&#x8BBE;&#x7F6E;&#x4EE3;&#x7406;&#x540E;&#x76D1;&#x542C;&#x56DE;&#x8C03;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x56DE;&#x8C03;&#xFF0C;&#x89E6;&#x53D1;&#x4EE3;&#x7406;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x5C31;&#x662F;&#x5728;&#x89E6;&#x53D1;&#x4EE3;&#x7406;&#x65B9;&#x6CD5;&#x8FD9;&#x4E00;&#x523B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x56DE;&#x8C03;&#x7684;&#x6570;&#x636E;&#x6539;&#x53D8;&#x6216;&#x5219;&#x66F4;&#x65B0;&#xFF0C;&#x5728;&#x63A7;&#x5236;&#x5668;&#x91CC;&#x9762;&#x6216;&#x5219;&#x5728;&#x6570;&#x636E;&#x5C42;&#x91CC;&#x9762;&#x6539;&#x52A8;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x662F;&#x4E00;&#x70B9;&#x70B9;&#x513F;&#xFF0C;&#x6570;&#x636E;&#x66F4;&#x65B0;&#x6539;&#x53D8;&#x7684;UI&#x6216;&#x5219;&#x89E6;&#x53D1;&#x7684;&#x4E8B;&#x4EF6;&#x662F;&#x5927;&#x91CF;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5C11;&#x91CF;&#x7684;&#x6570;&#x636E;&#x7528;&#x4EE3;&#x7406;&#x76D1;&#x542C;&#x56DE;&#x8C03;&#x8FD8;&#x884C;&#xFF0C;&#x6570;&#x636E;&#x4E00;&#x5927;&#xFF0C;&#x771F;&#x7684;&#x5F88;&#x5934;&#x75BC;&#x3002;&#x3002;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x7684;&#x505A;&#x56DE;&#x8C03;&#x7684;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x89E6;&#x53D1;&#x56DE;&#x8C03;&#x7684;&#x65F6;&#x5019;&#x6BD4;&#x8F83;&#x5934;&#x75BC;&#x3002;&#x3002;&#x3002;</strong></p>
<h4 id="block">Block&#x56DE;&#x8C03;&#x633A;&#x4E0D;&#x9519;&#x7684;&#xFF01;</h4>
<p><strong>&#x7F51;&#x7EDC;&#x5C42;&#x5927;&#x591A;&#x6570;&#x90FD;&#x7528;Block&#x505A;&#x56DE;&#x8C03;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5C42;&#x5EFA;&#x8BAE;&#x4E5F;&#x7528;Block&#x505A;&#x56DE;&#x8C03;&#xFF0C;&#x5728;Block&#x56DE;&#x8C03;&#x4E2D;&#xFF0C;&#x4E0D;&#x6210;&#x529F;&#x5219;&#x4E0D;&#x56DE;&#x8C03;&#x3002;&#x3002;&#x3002;&#x65E2;&#x7136;&#x90FD;&#x4E0D;&#x56DE;&#x8C03;&#x6CA1;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x5904;&#x7406;&#x7684;&#x3002;&#x3002;&#x3002;&#x4F7F;&#x7528;Block&#x6709;&#x4E00;&#x70B9;&#x4E0D;&#x597D;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x662F;Block&#x5728;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8C03;&#x7528;&#x5F97;&#x8D39;&#x70B9;&#x513F;&#x8111;&#x5B50;&#x3002;&#x3002;&#x3002;</strong></p>
<h4 id="notify">&#x8FD8;&#x6709;&#x4E00;&#x79CD;Notify&#xFF0C;&#x5DE5;&#x4F5C;&#x4E2D;&#x5E38;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x7528;&#x7684;&#x4E0D;&#x591A;&#xFF0C;&#x4E0D;&#x505A;&#x8BC4;&#x8BBA;&#x3002;&#x3002;&#x3002;</h4>
