<p align="left">&#x59D3;&#x540D;&#xFF1A;&#x90D1;&#x4E9A;&#x654F;</p>
<p align="left">&#x5DE5;&#x4F5C;&#x5355;&#x4F4D;&#xFF1A;&#x4E2D;&#x79D1;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x5171;&#x6027;&#x6280;&#x672F;&#x56FD;&#x5BB6;&#x5DE5;&#x7A0B;&#x7814;&#x7A76;&#x4E2D;&#x5FC3;&#x6709;&#x9650;&#x516C;&#x53F8;</p>
<p align="left">&#x804C;&#x4F4D;&#xFF1A;&#x9879;&#x76EE;&#x7ECF;&#x7406;</p>
<p align="left">&#xA0;</p>
<p align="left">&#x6587; / &#x90D1;&#x4E9A;&#x654F;</p>
<p align="left">&#xA0; &#xA0;</p>
<p align="left">&#xA0;</p>
<p align="left">&#x6211;&#x662F;&#x6211;&#x4EEC;&#x9879;&#x76EE;&#x7EC4;&#x7684;&#x201C;&#x4FDD;&#x59C6;&#x201D;&#xFF0C;&#x5728;&#x56E2;&#x961F;&#x91CC;&#x9762;&#x505A;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x63A8;&#x52A8;&#x654F;&#x6377;&#xFF0C;&#x505A;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x3002;&#x6211;&#x4EEC;&#x56E2;&#x961F;&#x662F;&#x4E2A;&#x6210;&#x957F;&#x671F;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x505A;&#x597D;&#x4E8B;&#x60C5;&#x9996;&#x5148;&#x8981;&#x505A;&#x597D;&#x56E2;&#x961F;&#x5EFA;&#x8BBE;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x6211;&#x5E26;&#x9886;&#x56E2;&#x961F;&#x7684;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#x3002;</p>
<p align="left">&#xA0;</p>
<p align="left"><strong>&#x56E2;&#x961F;&#x6587;&#x5316;&#x521B;&#x5EFA;&#xFF0C;&#x79EF;&#x6781;&#x4E3B;&#x52A8;</strong></p>
<p align="left">&#x6211;&#x8BA4;&#x4E3A;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x6709;&#x4E2A;&#x6562;&#x4E8E;&#x201C;&#x4EAE;&#x5251;&#x201D;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x5EFA;&#x7ACB;&#x56E2;&#x961F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5C3D;&#x53EF;&#x80FD;&#x627E;&#x4E00;&#x4E9B;&#x4EF7;&#x503C;&#x89C2;&#x76F8;&#x540C;&#x7684;&#x4EBA;&#x5458;&#x6765;&#x7EC4;&#x5EFA;&#x56E2;&#x961F;&#xFF0C;&#x6211;&#x66FE;&#x542C;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#x8BF4;&#x8FC7;&#xFF1A;&#x201C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x662F;&#x79EF;&#x6781;&#x4E3B;&#x52A8;&#x627E;&#x4E8B;&#x60C5;&#x505A;&#x7684;&#x4EBA;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x7279;&#x70B9;&#xFF0C;&#x90A3;&#x597D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x5458;&#x3002;&#x201D;&#x6280;&#x672F;&#x56FA;&#x7136;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#x6001;&#x5EA6;&#x66F4;&#x91CD;&#x8981;&#x3002;&#x5982;&#x679C;&#x8BC4;&#x4EF7;&#x4E00;&#x4E2A;&#x4EBA;&#x8981;&#x7528;&#x8FD9;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#x6765;&#x8BC4;&#x4EF7;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x662F;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x4F60;&#x6280;&#x672F;&#x6709;100&#x5206;&#xFF0C;&#x6001;&#x5EA6;&#x53EA;&#x6709;10&#x5206;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x6765;&#x6253;&#x5206;&#xFF0C;&#x6700;&#x591A;&#x7ED9;&#x4F60;20&#x5206;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4F5C;&#x4E3A;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x9996;&#x5148;&#x8981;&#x6709;&#x79EF;&#x6781;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x6709;&#x76F8;&#x540C;&#x7279;&#x70B9;&#x7684;&#x4EBA;&#x805A;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x505A;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4EF6;&#x591A;&#x4E48;&#x68D2;&#x7684;&#x4E8B;&#x60C5;&#x5440;&#xFF01;&#x7136;&#x540E;&#x8FD9;&#x4E2A;&#x56E2;&#x961F;&#x6210;&#x957F;&#x3001;&#x58EE;&#x5927;&#xFF0C;&#x81EA;&#x5DF1;&#x7BA1;&#x7406;&#x81EA;&#x5DF1;&#xFF0C;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x81EA;&#x7EC4;&#x7EC7;&#x56E2;&#x961F;&#x3002;&#x6709;&#x4E00;&#x5929;&#x4F60;&#x4F1A;&#x56E0;&#x4E3A;&#x81EA;&#x5DF1;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x800C;&#x611F;&#x5230;&#x81EA;&#x8C6A;&#x3002;</p>
<p align="left">&#xA0;</p>
<p align="left"><strong>&#x70B9;&#x5BF9;&#x70B9;&#x6C9F;&#x901A;</strong></p>
<p align="left">&#x6211;&#x4EEC;&#x56E2;&#x961F;&#x4E00;&#x76F4;&#x5728;&#x505A;&#x654F;&#x6377;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x51E0;&#x4E4E;&#x662F;&#x5728;&#x56DE;&#x987E;&#x4F1A;&#x8BAE;&#x4E0A;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E9B;&#x4E8B;&#x60C5;&#x9002;&#x5408;&#x5728;&#x4F1A;&#x8BAE;&#x4E0A;&#x8FDB;&#x884C;&#x89E3;&#x51B3;&#xFF0C;&#x6709;&#x7684;&#x4E8B;&#x60C5;&#x9700;&#x8981;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x6C9F;&#x901A;&#xFF0C;&#x6240;&#x4EE5;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x96BE;&#x7F20;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x7EE9;&#x6548;&#x3001;&#x4E2A;&#x4EBA;&#x53D1;&#x5C55;&#x3001;&#x4E0D;&#x5408;&#x4F5C;&#x7684;&#x8D44;&#x6E90;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x662F;&#x51B7;&#x9759;&#x4E0B;&#x6765;&#xFF0C;&#x70B9;&#x5BF9;&#x70B9;&#x5730;&#x8FDB;&#x884C;&#x6C9F;&#x901A;&#xFF0C;&#x8FD9;&#x6837;&#x6548;&#x679C;&#x4E5F;&#x8BB8;&#x4F1A;&#x66F4;&#x597D;&#x3002;</p>
<p align="left">&#xA0;</p>
<p align="left"><strong>&#x6211;&#x4EEC;&#x624B;&#x4E0A;&#x6709;&#x591A;&#x5C11;&#x4E8B;&#x60C5;&#xFF1F;</strong></p>
<p align="left">&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x6709;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x8981;&#x505A;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x60C5;&#x4E00;&#x4E2A;&#x4EBA;&#x5168;&#x90E8;&#x641E;&#x5B9A;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x505A;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#x3002;2015&#x5E74;&#xFF0C;&#x6211;&#x8EAB;&#x4E0A;&#x89D2;&#x8272;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982;&#x7814;&#x53D1;&#x3001;&#x9700;&#x6C42;&#x3001;&#x654F;&#x6377;&#x6559;&#x7EC3;&#x3001;&#x7248;&#x672C;&#x53D1;&#x5E03;&#x3001;&#x6570;&#x636E;&#x5E93;&#x7EF4;&#x62A4;&#x7B49;&#xFF0C;&#x7136;&#x540E;&#x81EA;&#x5DF1;&#x6BCF;&#x9879;&#x90FD;&#x505A;&#x5F97;&#x4E0D;&#x592A;&#x597D;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4EEC;&#x56E2;&#x961F;&#x5728;&#x4E00;&#x8D77;&#x5F00;&#x4F1A;&#x628A;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5DE5;&#x4F5C;&#x6E05;&#x5355;&#x5217;&#x51FA;&#x6765;&#x3002;&#x5982;&#x679C;&#x8C01;&#x8D1F;&#x8D23;&#x7684;&#x4E8B;&#x60C5;&#x8FC7;&#x591A;&#xFF0C;&#x4F1A;&#x628A;&#x76F8;&#x5173;&#x7684;&#x4E8B;&#x60C5;&#x8F6C;&#x79FB;&#x5230;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x624B;&#x4E0A;&#xFF0C;&#x8003;&#x6838;&#x4F60;&#x5728;&#x56E2;&#x961F;&#x91CC;&#x9762;&#x505A;&#x600E;&#x4E48;&#x6837;&#x3002;&#x8003;&#x6838;&#x56E2;&#x961F;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x662F;&#x81EA;&#x5DF1;&#x5217;&#x51FA;&#x5DE5;&#x4F5C;&#x6E05;&#x5355;&#xFF0C;&#x81EA;&#x5DF1;&#x7ED9;&#x81EA;&#x5DF1;&#x8BC4;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x521A;&#x505A;&#x5B8C;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x611F;&#x89C9;&#x597D;&#x5174;&#x594B;&#x3002;</p>
<p align="left">&#xA0;</p>
<p align="left"><strong>&#x654F;&#x6377;&#x6559;&#x7EC3;&#x8D8A;&#x806A;&#x660E;&#xFF0C;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x5C31;&#x8D8A;&#x7B28;&#x62D9;</strong></p>
<p align="left">&#x5728;&#x6267;&#x884C;&#x654F;&#x6377;&#x4E00;&#x5E74;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x63D0;&#x8D77;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x5BF9;&#x4E0A;&#x9762;&#x8FD9;&#x53E5;&#x8BDD;&#x611F;&#x89E6;&#x9887;&#x6DF1;&#x3002;&#x4E0D;&#x8981;&#x66FF;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x505A;&#x4EFB;&#x4F55;&#x51B3;&#x5B9A;&#xFF0C;&#x8BA9;&#x56E2;&#x961F;&#x81EA;&#x5DF1;&#x6539;&#x8FDB;&#xFF0C;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#x6BCF;&#x4E2A;&#x4EBA;&#x624D;&#x4F1A;&#x6210;&#x957F;&#x3002;&#x4E4B;&#x524D;&#x5728;&#x6BCF;&#x6B21;&#x56DE;&#x987E;&#x4F1A;&#x8BAE;&#xFF0C;&#x6211;&#x90FD;&#x66FF;&#x56E2;&#x961F;&#x505A;&#x51B3;&#x5B9A;&#xFF0C;&#x7ED3;&#x679C;&#x56E2;&#x961F;&#x4E0D;&#x53BB;&#x6267;&#x884C;&#x3002;&#x867D;&#x7136;&#x81EA;&#x5DF1;&#x5728;&#x4F1A;&#x8BAE;&#x4E0A;&#x5927;&#x5927;&#x51FA;&#x98CE;&#x5934;&#xFF0C;&#x53EF;&#x662F;&#x7ED3;&#x679C;&#x5462;&#xFF1F;&#x56E2;&#x961F;&#x51E0;&#x4E4E;&#x4E00;&#x76D8;&#x6563;&#x6C99;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x653E;&#x6743;&#xFF0C;&#x6FC0;&#x52B1;&#x548C;&#x5F15;&#x5BFC;&#x56E2;&#x961F;&#x5411;&#x597D;&#x7684;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#x5373;&#x53EF;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x53BB;&#x505A;&#x3002;</p>
<p align="left">&#xA0;</p>
<p align="left"><strong>&#x4EE5;&#x81EA;&#x5DF1;&#x4EF7;&#x503C;&#x89C2;&#x4E3A;&#x9A71;&#x52A8;</strong></p>
<p align="left">&#xA0;&#xA0;&#xA0;&#xA0; &#x5982;&#x679C;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x505A;&#xFF0C;&#x600E;&#x4E48;&#x9009;&#x62E9;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4EE5;&#x4F60;&#x81EA;&#x5DF1;&#x4EF7;&#x503C;&#x89C2;&#x4E3A;&#x9A71;&#x52A8;&#xFF0C;&#x4F60;&#x8BA4;&#x4E3A;&#x5BF9;&#x56E2;&#x961F;&#x597D;&#x7684;&#xFF0C;&#x62FF;&#x5C31;&#x505A;&#x8D77;&#x6765;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x56E2;&#x961F;&#x4E0D;&#x4F1A;&#x602A;&#x7F6A;&#x4E8E;&#x4F60;&#x3002;&#x6478;&#x7740;&#x77F3;&#x5934;&#x8FC7;&#x6CB3;&#xFF0C;&#x5141;&#x8BB8;&#x5927;&#x5BB6;&#x72AF;&#x9519;&#xFF0C;&#x8FD9;&#x79CD;&#x6587;&#x5316;&#x662F;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x5728;&#x63D0;&#x5021;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x6301;&#x7EED;&#x6539;&#x8FDB;&#x7684;&#x3002;</p>